# SLU06 - Dealing with Data Problems

In [1]:
import os
import pandas as pd
import numpy as np
import copy
import hashlib
import json
import warnings
import calendar
import datetime
warnings.filterwarnings('ignore')
import pycountry_convert as cc

Welcome to the wonderful world of Data Cleanup! In the real would, a lot of good people are spending a lot of time  cleaning datasets and getting them down to a form with which they can work. 

There is one thing that you should always keep in mind when working with data:

<img src="media/clean-you-must.jpg"/>

Let's get our hands dirty.

## The CR hotels

You took a job as a data scientist in the fancy CR hotel imperium. Your first task is to clean a dataset of reservations from 2015 to 2017. You need to get it nice and tidy before it can be analysed.

Here is the data dictionary for the dataset:
- **hotel:** Resort Hotel or City Hotel
- **is_canceled:** Value indicating if the booking was canceled (1) or not (0)
- **lead_time:** Number of days that elapsed between the date of the booking and the arrival date
- **arrival_date**: Arrival date formatted as "Month Day Year"
- **stays_in_weekend_nights:** Number of weekend nights (Saturday or Sunday) the guest booked at the hotel
- **stays_in_week_nights:** Number of week nights (Monday to Friday) the guest booked at the hotel
- **adults**: Number of adults
- **is_repeated_guest:** Value indicating if the booking is from a repeated guest (1) or not (0)
- **previous_cancelations:** Number of previous bookings that were canceled by the customer prior to the current booking
- **agent:** ID of the travel agency that made the booking
- **adr:** Average Daily Rate defined as the total price of the stay divided by the number of staying nights
- **total_of_special_requests:** Number of special requests made by the customer (e.g. twin bed or high floor)
- **reservation_status:** Last status of the reservation, assuming one of three categories: Canceled – booking was canceled by the customer; Check-Out – customer checked in and out of the hotel; No-Show – customer did not check in and did not inform the hotel of the reason why
- **reservation_status_date:** Date at which the last status was set. This variable can be used in conjunction with the ReservationStatus to understand when was the booking canceled or when did the customer check out of the hotel

### Exercise 1.1

Let's start by importing the dataset and taking a look at it. The dataset is located in the `data` folder, in a file named `crset_hotel_bookings.csv`. This file came straight out of MS Excel, so the values are separated by semicolons. Load the dataset into the `df_crset` dataframe.

In [2]:
# use pandas to load the data into the df_crset dataframe
df_crset = pd.read_csv('data/crset_hotel_bookings.csv', sep=';')

In [3]:
assert isinstance(df_crset, pd.DataFrame), "df_crset should be a dataframe"
assert df_crset.shape == (119390, 14), "The shape of the dataframe is different then expected. Are you using the right separator?"
df_crset.head()

,hotel,is_canceled,lead_time,arrival_date,stays_in_weekend_nights,stays_in_week_nights,adults,is_repeated_guest,previous_cancelations,agent,adr,total_of_special_requests,reservation_status,reservation_status_date
0,Resort Hotel,0,342,July 1 2015,0,0,2,0,0,NaN,0.0,0,Check-Out,01/07/2015
1,Resort Hotel,0,737,July 1 2015,0,0,2,0,0,NaN,0.0,0,Check-Out,01/07/2015
2,Resort Hotel,0,7,July 1 2015,0,1,1,0,0,NaN,75.0,0,Check-Out,02/07/2015
3,Resort Hotel,0,13,July 1 2015,0,1,1,0,0,304.0,75.0,0,Check-Out,02/07/2015
4,Resort Hotel,0,14,July 1 2015,0,2,2,0,0,240.0,98.0,1,Check-Out,03/07/2015

### Exercise 1.2 - Arrival Date 

Let's start by cleaning the arrival date. According to the data dictionary and the first 5 rows of the dataframe, the `arrival_date` stores a string with the month spelled out, the day in numeral and the year in numeral.

Create a function called `format_arrival_date()` that extracts the day, month, and year values from this column and stores this information in new columns `arrival_date_month`, `arrival_date_day` and `arrival_date_year`. All values should be integers. Remove the  `arrival_data` column and return the cleaned dataframe. 

You can use the `calendar.month_name` function from the [calendar python module](https://docs.python.org/3/library/calendar.html#module-calendar) and pandas `map()` method.

In [4]:
def format_arrival_date(df: pd.DataFrame)->pd.DataFrame:
    """
    This function cleans the "arrival_date" column
    """
    #first step will be to divide the arrival_date into 3 new columns
    df_arrival_date = df.arrival_date.str.split(pat = ' ', expand=True)
    df_arrival_date.columns = ["arrival_date_month", "arrival_date_day", "arrival_date_year"]
    df_arrival_date['arrival_date_month'] = pd.to_datetime(df_arrival_date.arrival_date_month, format='%B').dt.month
    df_arrival_date = df_arrival_date.astype({"arrival_date_month": int, "arrival_date_day": int, "arrival_date_year": int})
    #then will remove the arrival_date column
    df_no_arrival_data = df.drop('arrival_date', axis = 1)
    #merge the two dataframes
    merged_df = df_no_arrival_data.merge(df_arrival_date, left_index =True, right_index =True)
    
    return merged_df

In [5]:
clean_arrival = format_arrival_date(df_crset)
assert isinstance(clean_arrival, pd.DataFrame), "The function should return a dataframe."
assert clean_arrival.shape == (119390, 16), "The shape of the dataframe is different then expected."
assert 'arrival_date' not in clean_arrival.columns, "You should remove the old arrival_date column."
assert 'arrival_date_month' in clean_arrival.columns, "You're missing the arrival_date_month column. Have you named the new column correctly?"
assert 'arrival_date_day' in clean_arrival.columns, "You're missing the arrival_date_day column. Have you named the new column correctly?"
assert 'arrival_date_year'  in clean_arrival.columns, "You're missing the arrival_date_year column. Have you named the new column correctly?"
assert all(isinstance(item, int) for item in clean_arrival.arrival_date_month), "Months should be saved as integers." 
assert all(isinstance(item, int) for item in clean_arrival.arrival_date_day), "Days should be saved as integers."
assert all(isinstance(item, int) for item in clean_arrival.arrival_date_year), "Years should be saved as integers."
assert hashlib.sha256(json.dumps(str(clean_arrival.arrival_date_month.sum())).encode()).hexdigest() == 'd3d4cd02abe661b2bc608a13cc791e7543da035d1c729ce171b1fda52effd8c8', "Something is wrong with your month conversion."
assert hashlib.sha256(json.dumps(str(clean_arrival.arrival_date_day.sum())).encode()).hexdigest() == '4db570fffca303e3eeb7ec3bc940a3812f8466a3b6e0d8b44633eaabde411ed4', "Something is wrong with your day conversion."
assert hashlib.sha256(json.dumps(str(clean_arrival.arrival_date_year.sum())).encode()).hexdigest() == '2f83dbe44d408f6735bc778eed604edf730377524018bb9f6a176e503511d033', "Something is wrong with your year conversion."

### Exercise 1.3 - Week of year 

Create a function named `get_week_of_year` that takes the newly created columns `arrival_date_month`, `arrival_date_day` and `arrival_date_year` and creates a new variable in the same dataframe called `arrival_date_week_number` with the week number of the arrival date.

You can use the `date.isocalendar()` method from the [datetime python module](https://docs.python.org/3/library/datetime.html) and pandas `apply()` method.

In [6]:
def get_week_of_year(df: pd.DataFrame)->pd.DataFrame:
    """
    This function gets the arrival week of the year
    """
    #create new column and add the date from new columns
    df['arrival_date_week_number'] = df.arrival_date_year.astype(str) + ", " + df.arrival_date_month.astype(str) + ", " + df.arrival_date_day.astype(str)
    #convert to date format
    df['arrival_date_week_number'] = pd.to_datetime(df["arrival_date_week_number"], infer_datetime_format=True)
    #apply function to transfor date to week n.
    df['arrival_date_week_number'] = df['arrival_date_week_number'].apply(lambda x: x.isocalendar()[1])
    
    return df

In [7]:
clean_arrival_week_of_year = get_week_of_year(clean_arrival)
assert isinstance(clean_arrival_week_of_year, pd.DataFrame), "The function should return a dataframe."
assert clean_arrival_week_of_year.shape == (119390, 17), "The shape of the dataframe is different then expected. Have you saved the new column?"
assert 'arrival_date_week_number' in clean_arrival_week_of_year.columns, "You're missing the clean_arrival_week_of_year column. Have you named the new column correctly?"
assert all(isinstance(item, int) for item in clean_arrival_week_of_year.arrival_date_week_number), "The values in the new column should be integers." 
assert hashlib.sha256(json.dumps(str(clean_arrival_week_of_year.arrival_date_week_number)).encode()).hexdigest() == 'fbd3bdce9f2b3a1aff60369c351a1ceb63a167a80d78b140859af7f687cd76a3', "Something is wrong with your data conversion."

### Exercise 1.4 - The reservation status date

Do the same processing as for the `arrival_date` column but this time for the `reservation_status_date` - extract the day, month, year, and week number and store them in new columns as integers. The columns should be named `reservation_status_date_day`, `reservation_status_date_month` and so on. Remove the `reservation_status_date` column and return the cleaned dataframe.

All the steps should be done in a single function named `process_reservation_status_date()`.

In [8]:
def process_reservation_status_date(df: pd.DataFrame)->pd.DataFrame:
    """
    This function cleans "reservation_status_date" column
    """
    #first step will be to divide the arrival_date into new dataframe with 3 columns
    df_data_status = df.reservation_status_date.str.split(pat = '/', expand=True)
    df_data_status.columns = ["reservation_status_date_day", "reservation_status_date_month", "reservation_status_date_year"]
    #change the dtype
    df_data_status = df_data_status.astype({"reservation_status_date_day": int, "reservation_status_date_month": int, "reservation_status_date_year": int})
    
    #next step is to add the new week column using date 
    df_data_status['reservation_status_date_week_number'] = df_data_status.reservation_status_date_year.astype(str) + ', ' + df_data_status.reservation_status_date_month.astype(str) + ', ' + df_data_status.reservation_status_date_day.astype(str)
    df_data_status['reservation_status_date_week_number'] = pd.to_datetime(df_data_status["reservation_status_date_week_number"], infer_datetime_format=True)
    df_data_status['reservation_status_date_week_number'] = df_data_status['reservation_status_date_week_number'].apply(lambda x: x.isocalendar()[1])

    #then will remove the arrival_date column from original df
    df_no_data_status = df.drop('reservation_status_date', axis = 1)
    #merge the two dataframes
    merged_df = df_no_data_status.merge(df_data_status, left_index =True, right_index =True)

    return merged_df
    
clean_status_date = process_reservation_status_date(clean_arrival_week_of_year)
clean_status_date.head()

,hotel,is_canceled,lead_time,stays_in_weekend_nights,stays_in_week_nights,adults,is_repeated_guest,previous_cancelations,agent,adr,total_of_special_requests,reservation_status,arrival_date_month,arrival_date_day,arrival_date_year,arrival_date_week_number,reservation_status_date_day,reservation_status_date_month,reservation_status_date_year,reservation_status_date_week_number
0,Resort Hotel,0,342,0,0,2,0,0,NaN,0.0,0,Check-Out,7,1,2015,27,1,7,2015,27
1,Resort Hotel,0,737,0,0,2,0,0,NaN,0.0,0,Check-Out,7,1,2015,27,1,7,2015,27
2,Resort Hotel,0,7,0,1,1,0,0,NaN,75.0,0,Check-Out,7,1,2015,27,2,7,2015,27
3,Resort Hotel,0,13,0,1,1,0,0,304.0,75.0,0,Check-Out,7,1,2015,27,2,7,2015,27
4,Resort Hotel,0,14,0,2,2,0,0,240.0,98.0,1,Check-Out,7,1,2015,27,3,7,2015,27

In [9]:
clean_status_date = process_reservation_status_date(clean_arrival_week_of_year)
assert isinstance(clean_status_date, pd.DataFrame), "The function should return a dataframe."
assert clean_status_date.shape == (119390, 20), "The shape of the dataframe is different then expected. Have you dropped the old reservation_status_date column?"
assert 'reservation_status_date' not in clean_status_date.columns, "You should remove the old reservation_status_date column."
assert 'reservation_status_date_day' in clean_status_date.columns, "You're missing the day column. Have you named the new column correctly?"
assert 'reservation_status_date_month' in clean_status_date.columns, "You're missing the month column. Have you named the new column correctly?"
assert 'reservation_status_date_year'  in clean_status_date.columns, "You're missing the year column. Have you named the new column correctly?"
assert 'reservation_status_date_week_number'  in clean_status_date.columns, "You're missing the week number column. Have you named the new column correctly?"
assert all(isinstance(item, int) for item in clean_status_date.reservation_status_date_day), "Days should be integers." 
assert all(isinstance(item, int) for item in clean_status_date.reservation_status_date_month), "Months should be integers."
assert all(isinstance(item, int) for item in clean_status_date.reservation_status_date_year), "Years should be integers."
assert all(isinstance(item, int) for item in clean_status_date.reservation_status_date_week_number), "Week of the year should an integer."
assert hashlib.sha256(json.dumps(str(clean_status_date.reservation_status_date_week_number)).encode()).hexdigest() == '035d73f3bf98929a3e2d1ea7b1dd02645a86cc8f1d751dd088533b0e11de0352', "Something is wrong with your data conversion in reservation_status_date_week_number."
assert hashlib.sha256(json.dumps(str(clean_status_date.reservation_status_date_month.sum())).encode()).hexdigest() == '8505858d4a9ee251ff772f4486d8b18f63e2d2015da3ab435371a604800b8f69', "Something is wrong with your month conversion."
assert hashlib.sha256(json.dumps(str(clean_status_date.reservation_status_date_day.sum())).encode()).hexdigest() == 'f8c8d1439b0d0d51ea8a9dc900dc4309b7364a5c4791b417c0e6a5cc093fc9b8', "Something is wrong with your day conversion."
assert hashlib.sha256(json.dumps(str(clean_status_date.reservation_status_date_year.sum())).encode()).hexdigest() == '0c1465052551cc91c40abbd465ae0337ebc526a00b5b536b9d8bfbe8cc35ef3f', "Something is wrong with your year conversion."

### Exercise 2 - Missing data

Let's now look at missing data.

In [10]:
np.sum(clean_status_date.isnull())

hotel                                      0
is_canceled                                0
lead_time                                  0
stays_in_weekend_nights                    0
stays_in_week_nights                       0
adults                                     0
is_repeated_guest                          0
previous_cancelations                      0
agent                                  16340
adr                                        0
total_of_special_requests                  0
reservation_status                         0
arrival_date_month                         0
arrival_date_day                           0
arrival_date_year                          0
arrival_date_week_number                   0
reservation_status_date_day                0
reservation_status_date_month              0
reservation_status_date_year               0
reservation_status_date_week_number        0
dtype: int64

There's over 16000 missing values in the `agent` column, representing over 10% of the total observations and we need to do something about it. 

Usually if more than 70% of values in a column are missing and there is no way to fill them in, then the column can be completely dropped from the dataset. Our `agent` column is a categorical variable that represents the ID of the travel agency that made the booking. We can fill out the missing values with a new category named `unknown`.

Create a new function named `impute_agents` that does exactly that.

In [11]:
def impute_agents(df: pd.DataFrame)->pd.DataFrame:
    """
    This function imputs the missing values in the agents column with a new 'unknown' category
    """
    df.agent = df.agent.fillna("unknown")
    
    return df

In [12]:
imputed_df = impute_agents(clean_status_date) 
imputed_df.head()

np.sum(imputed_df.isnull())

hotel                                  0
is_canceled                            0
lead_time                              0
stays_in_weekend_nights                0
stays_in_week_nights                   0
adults                                 0
is_repeated_guest                      0
previous_cancelations                  0
agent                                  0
adr                                    0
total_of_special_requests              0
reservation_status                     0
arrival_date_month                     0
arrival_date_day                       0
arrival_date_year                      0
arrival_date_week_number               0
reservation_status_date_day            0
reservation_status_date_month          0
reservation_status_date_year           0
reservation_status_date_week_number    0
dtype: int64

In [13]:
imputed_df = impute_agents(clean_status_date) 
assert isinstance(imputed_df, pd.DataFrame), "The fucntion should return a dataframe."
assert hashlib.sha256(json.dumps(str(imputed_df.agent)).encode()).hexdigest() == 'e88eaebe8668246fc74259c12ea8e38311c86ec96a73e2a8de26eb30bb7aefb9', "Something is wrong with your data imputation." 
assert hashlib.sha256(json.dumps(sorted(imputed_df.agent[imputed_df.agent == 'unknown'].sum())).encode()).hexdigest() == 'bb80fda4a664ce06ee5d39edb0488f95a9496f1a7dde86e8b750246967e5a921', "Did you fill in all the missing values?"

## Exercise 3 - Drop duplicates

The last thing you need to ensure is that yourdataset doesn't have any duplicated data.
Create a short function to remove duplicates!

In [14]:
imputed_df.head()

,hotel,is_canceled,lead_time,stays_in_weekend_nights,stays_in_week_nights,adults,is_repeated_guest,previous_cancelations,agent,adr,total_of_special_requests,reservation_status,arrival_date_month,arrival_date_day,arrival_date_year,arrival_date_week_number,reservation_status_date_day,reservation_status_date_month,reservation_status_date_year,reservation_status_date_week_number
0,Resort Hotel,0,342,0,0,2,0,0,unknown,0.0,0,Check-Out,7,1,2015,27,1,7,2015,27
1,Resort Hotel,0,737,0,0,2,0,0,unknown,0.0,0,Check-Out,7,1,2015,27,1,7,2015,27
2,Resort Hotel,0,7,0,1,1,0,0,unknown,75.0,0,Check-Out,7,1,2015,27,2,7,2015,27
3,Resort Hotel,0,13,0,1,1,0,0,304.0,75.0,0,Check-Out,7,1,2015,27,2,7,2015,27
4,Resort Hotel,0,14,0,2,2,0,0,240.0,98.0,1,Check-Out,7,1,2015,27,3,7,2015,27

In [15]:
def drop_duplicated_entries(df: pd.DataFrame)->pd.DataFrame:
    """
    This function drops duplicates from the dataframe
    """
    #rows with exact matches are flagged as True, except for the first
    duplicated_mask = df.duplicated(keep = 'first')
    #delete all flagged as True
    droped_df = df.drop_duplicates()
    
    return droped_df

In [16]:
clean_crset_df = drop_duplicated_entries(imputed_df)
assert isinstance(clean_crset_df, pd.DataFrame), "The function should return a dataframe."
assert clean_crset_df.shape == (82870, 20), "The shape of the dataframe is different then expected. Have you removed all the duplicated rows?"

Congratulations! The *CRSet() Hotel* dataset is looking very clean and tidy!
<img src="https://static.toiimg.com/thumb/msid-78693940,width-1200,height-900,resizemode-4/.jpg" width="400">

## A mess to be tidied up

You decided to switch to a more interesting job with the World Health Organization analyzing disease incidence across the world. Your first task is to analyse the incidence of tuberculosis between 1989 and 2008. WHO has been recording the cases all over the world. They have good intentions, but not very good methods to store data.

<img src="media/tbc.png"  width="400">

Let's have a look:

In [17]:
df_tb_who = pd.read_csv(os.path.join('data', 'tb.csv'), sep=',')
df_tb_who.head()

,iso2,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,...,new_sp_f04,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu
0,AD,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,AD,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,AD,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,AD,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,AD,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [18]:
df_tb_who.dtypes

iso2             object
year              int64
new_sp          float64
new_sp_m04      float64
new_sp_m514     float64
new_sp_m014     float64
new_sp_m1524    float64
new_sp_m2534    float64
new_sp_m3544    float64
new_sp_m4554    float64
new_sp_m5564    float64
new_sp_m65      float64
new_sp_mu       float64
new_sp_f04      float64
new_sp_f514     float64
new_sp_f014     float64
new_sp_f1524    float64
new_sp_f2534    float64
new_sp_f3544    float64
new_sp_f4554    float64
new_sp_f5564    float64
new_sp_f65      float64
new_sp_fu       float64
dtype: object

In [19]:
df_tb_who.shape

(5769, 23)

The dataset contains counts of confirmed tuberculosis cases by country, year and demographic group. The demographic data contains information on sex (*m* for male and *f* for female)  and age (*0-14, 15-24, 25-34, 35-44, 45-54, 55-64* and *65+*). Except for the column `year`, the column names are not very intuitive. The column `iso2` contains the country code in [iso2 format](https://www.iso.org/iso-3166-country-codes.html). The remaining columns are actually joint realizations of two variables: `sex` and `age`.

## Exercise 4 - Country 

Start by addressing the `iso2` column. Save in a new `country` column the corresponding country name from the iso2 code. The [pycountry-convert](https://pypi.org/project/pycountry-convert/) package is your friend! It's already imported as `cc`.

First, create a function `get_country` that converts the iso2 code to country name. If the name cannot be retrieved, the function should return the original iso2 code. Afterwards copy the who dataframe to new `df_tb_who_country` dataframe, apply the function and drop the `iso2` column.

In [20]:
#Function for the convertion from code to country name 
def get_country(df):
    try:
        code = str(df['iso2'])
        country = cc.country_alpha2_to_country_name(code, cn_name_format="default")
        
    except KeyError:
        country = str(df['iso2'])

    return country

df_tb_who_country = df_tb_who
df_tb_who_country["country"] = df_tb_who_country.apply(get_country, axis =1)

df_tb_who_country = df_tb_who_country.drop('iso2', axis = 1)

In [21]:
assert isinstance(df_tb_who_country, pd.DataFrame), "The result should be a dataframe."
assert 'iso2' not in df_tb_who_country.columns, "You should drop the original iso2 column."
assert 'country' in df_tb_who_country.columns, "Have you stored the results in a new column named 'country'?"
assert hashlib.sha256(json.dumps(sorted(df_tb_who_country['country'].unique())).encode()).hexdigest() == '40515e68a196feaac974999d8d4fa9f3dd814e1bde66243a968fadf41a8e84de', "Have you converted the iso2 codes to the country NAME?"

## Exercise 5 - the melt function

This is our dataframe with country names:

In [22]:
df_tb_who_country.head()

,year,new_sp,new_sp_m04,new_sp_m514,new_sp_m014,new_sp_m1524,new_sp_m2534,new_sp_m3544,new_sp_m4554,new_sp_m5564,...,new_sp_f514,new_sp_f014,new_sp_f1524,new_sp_f2534,new_sp_f3544,new_sp_f4554,new_sp_f5564,new_sp_f65,new_sp_fu,country
0,1989,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Andorra
1,1990,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Andorra
2,1991,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Andorra
3,1992,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Andorra
4,1993,15.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Andorra

Before we can continue, we need to tidy it up. Of all the columns, only two are variables, `year` and `country`. All the other column names are values. 

Use the function `melt()` to tidy the dataframe and store it in `tidy_tb`. Keep the `country` and `year` columns and melt all the other columns. Store the melted column names in the variable `column_name` and their values in variable `cases`.

In [23]:
info_values = [x for x in df_tb_who_country.columns.tolist() if x != 'year' and x != 'country']

tidy_tb = pd.melt(df_tb_who_country, id_vars = ["year", "country"], value_vars = info_values, var_name = "column_name", value_name = "cases")

In [24]:
tidy_tb.head(6)

   year  country column_name  cases
0  1989  Andorra      new_sp    NaN
1  1990  Andorra      new_sp    NaN
2  1991  Andorra      new_sp    NaN
3  1992  Andorra      new_sp    NaN
4  1993  Andorra      new_sp   15.0
5  1994  Andorra      new_sp   24.0

In [25]:
assert isinstance(tidy_tb, pd.DataFrame), "The result should be a dataframe."
assert tidy_tb.shape == (121149, 4), "Your dataframe doesn't have the expected shape. Have you melted the dataframe correctly?"
assert "column_name" in tidy_tb.columns, "The variables other than 'country' and 'year' should be stored in a column named 'column_name'."
assert "cases" in tidy_tb.columns, "Number of cases should be stored in a column named 'cases'."
assert hashlib.sha256(json.dumps(sorted(tidy_tb['column_name'])).encode()).hexdigest() == '4ba594d958d63b5bab87fe50944b16f30a93824e56fa331d5d9b59dddf285e35', "The column_name column doesn't look as expected" 
assert hashlib.sha256(json.dumps(sorted(tidy_tb['cases'])).encode()).hexdigest() == '8a294cd49c8fc1b29b60893e45426a80cb9681be4c699ae950c7103552cc7153', "The cases column doesn't look as expected"

## Exercise 6 - Data cleanup

Our dataframe is tidy, but it's not clean. From the `tidy_tb` dataframe, drop all the rows where `cases` **OR** `country` is null, as we just don't have any information and we cannot guess the number of cases or the country of origin. Convert the `cases` column to `int`. Save the final dataframe in `clean_tidy_tb` sorted by `country`, `year`, and `column_name`. The indexes should be reset (with `drop=True`).

In [26]:
#drop all the rows without cases info
tidy_tb_nona = tidy_tb.dropna()
#drop all the rows with nan country 
i = tidy_tb_nona[tidy_tb_nona.country == 'nan'].index
tidy_tb_nona_c = tidy_tb_nona.drop(i)

#convert cases to int
tidy_tb_nona_int = tidy_tb_nona_c.astype({"cases": int})

#final sorted dataframe
clean_tidy_tb = tidy_tb_nona_int.sort_values(['country', 'year', 'column_name']).reset_index(drop=True)

clean_tidy_tb.shape

(38619, 4)

In [27]:
assert isinstance(clean_tidy_tb, pd.DataFrame), "The result should be a dataframe."
assert clean_tidy_tb.shape == (38619, 4), "The shape of the dataframe is not correct."
assert hashlib.sha256(json.dumps(sorted(tidy_tb['country'])).encode()).hexdigest() == '43543c9e06fe9846897c269db635da02fc76dae4527775062a2f66efc707e87e', "There is something wrong with the values in the country column."
assert hashlib.sha256(json.dumps(sorted(tidy_tb['cases'])).encode()).hexdigest() == '8a294cd49c8fc1b29b60893e45426a80cb9681be4c699ae950c7103552cc7153', "There is something wrong with the values in the cases column."

## Exercise 7 - Multiple Variables stored in one Column

Our `clean_tidy_tb` is looking better, but now we need to address the problem of having multiple variables stored in the `column_name` column. Let's fix that in a few steps.

### Exercise 7.1 

From the `column_name` column, extract the codes for female/male to a new column named `sex` and the codes for the age to a new column `age`. Use pandas `str.extract` to do this. Drop all missing values afterwards.

In [28]:
#clean_tidy_tb[["sex", "age"]] = pd.

#extract the age (only number)
clean_tidy_tb["sex"] = clean_tidy_tb["column_name"].str.extract('([fm])')
clean_tidy_tb["age"] = clean_tidy_tb["column_name"].str.extract('(\d+)')
clean_tidy_tb["age2"] = clean_tidy_tb["column_name"].str.extract('([u])')
#merge the two age columns
clean_tidy_tb['age'].update(clean_tidy_tb.pop('age2'))

#drop na values
clean_tidy_tb = clean_tidy_tb.dropna()

#check data 
np.sum(clean_tidy_tb.isnull())
clean_tidy_tb

       year   country   column_name  cases sex   age
1      1996        AN   new_sp_f014      0   f   014
2      1996        AN  new_sp_f1524      0   f  1524
3      1996        AN  new_sp_f2534      0   f  2534
4      1996        AN  new_sp_f3544      1   f  3544
5      1996        AN  new_sp_f4554      0   f  4554
...     ...       ...           ...    ...  ..   ...
38614  2008  Zimbabwe  new_sp_m3544   3316   m  3544
38615  2008  Zimbabwe  new_sp_m4554    704   m  4554
38616  2008  Zimbabwe  new_sp_m5564    263   m  5564
38617  2008  Zimbabwe    new_sp_m65    185   m    65
38618  2008  Zimbabwe     new_sp_mu      0   m     u

[35552 rows x 6 columns]

In [29]:
assert isinstance(clean_tidy_tb, pd.DataFrame), "The result should be a dataframe."
assert clean_tidy_tb.shape == (35552, 6), "The shape of your dataframe is off. Have you dropped the missing values?"
assert hashlib.sha256(json.dumps(sorted(clean_tidy_tb['sex'].unique())).encode()).hexdigest() == '1a336f5ee71cf591bfd047e8facc048011b4b2bb760743e979ebe7c445dacf1b', "The values in the sex column are not ok."
assert hashlib.sha256(json.dumps(sorted(clean_tidy_tb['age'].unique())).encode()).hexdigest() == '70a6918917681862857b955b14e70f7bc68d0050382ef81945fe963e48135f10', "The values in the age column are not ok."

### Exercise 7.2

The values in the `age` column are not very easy to understand. Use the `decode_age` dictionary to convert them to a more readable format. Drop any row where the values could not be converted.

In [30]:
decode_age =   {
        "014": "0-14",
        "1524": "15-24",
        "2534": "25-34",
        "3544": "35-44",
        "4554": "45-54",
        "5564": "55-64",
        "65": "65+",
        "u": "unknown",
    }

In [31]:
#remap the values using dict
clean_tidy_tb['age'] = clean_tidy_tb['age'].map(decode_age)

#drop the na
clean_tidy_tb = clean_tidy_tb.dropna()

clean_tidy_tb.head()
#np.sum(clean_tidy_tb.isnull())

   year country   column_name  cases sex    age
1  1996      AN   new_sp_f014      0   f   0-14
2  1996      AN  new_sp_f1524      0   f  15-24
3  1996      AN  new_sp_f2534      0   f  25-34
4  1996      AN  new_sp_f3544      1   f  35-44
5  1996      AN  new_sp_f4554      0   f  45-54

In [32]:
assert hashlib.sha256(json.dumps(sorted(clean_tidy_tb['age'].unique())).encode()).hexdigest() == '8135dd0c090f9073cbb69a7bbacefd8ad0ecdb6e26415ece93e3fb5f8f5d17e6', "The decoding did not work as expected."

### Exercise 7.3

Finally, save in `final_tb_df` the dataframe with just the columns "country", "year", "sex", "age" and "cases".

In [36]:
final_tb_df = clean_tidy_tb.drop("column_name", axis=1)
final_tb_df

       year   country  cases sex      age
1      1996        AN      0   f     0-14
2      1996        AN      0   f    15-24
3      1996        AN      0   f    25-34
4      1996        AN      1   f    35-44
5      1996        AN      0   f    45-54
...     ...       ...    ...  ..      ...
38614  2008  Zimbabwe   3316   m    35-44
38615  2008  Zimbabwe    704   m    45-54
38616  2008  Zimbabwe    263   m    55-64
38617  2008  Zimbabwe    185   m      65+
38618  2008  Zimbabwe      0   m  unknown

[33962 rows x 5 columns]

In [35]:
assert isinstance(final_tb_df, pd.DataFrame), "The result should be a dataframe."
assert final_tb_df.shape == (33962, 5), "The shape of your dataframe is off."
assert sorted(final_tb_df.columns) == ['age', 'cases', 'country', 'sex', 'year'], "The column names are not as expected."

Congratulations!!! You're a data cleaning master!

<img src="media/good-job.jpg"  width="400">